In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [10]:
pd.Series(data = my_data, index = labels)
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [15]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [17]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])

In [20]:
ser3 = pd.Series(data=labels)
ser3

0    a
1    b
2    c
dtype: object

In [23]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [25]:
from numpy.random import randn

In [26]:
np.random.seed(101)

In [28]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
df[['W', 'Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [38]:
df['new'] = df['W'] + df['Z']
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [39]:
newind = 'CA NY WY OR CO'.split()

In [41]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [42]:
df['States'] = newind

In [52]:
df

               W         X         Y         Z       new
States
CA      0.302665  1.693723 -1.706086 -1.159119 -0.856454
NY     -0.134841  0.390528  0.166905  0.184502  0.049661
WY      0.807706  0.072960  0.638787  0.329646  1.137352
OR     -0.497104 -0.754070 -0.943406  0.484752 -0.012352
CO     -0.116773  1.901755  0.238127  1.996652  1.879879

In [53]:
df.reset_index()

  States         W         X         Y         Z       new
0     CA  0.302665  1.693723 -1.706086 -1.159119 -0.856454
1     NY -0.134841  0.390528  0.166905  0.184502  0.049661
2     WY  0.807706  0.072960  0.638787  0.329646  1.137352
3     OR -0.497104 -0.754070 -0.943406  0.484752 -0.012352
4     CO -0.116773  1.901755  0.238127  1.996652  1.879879

In [ ]:
# Index Levels